module.exports.config = {
    name: "quran",
    version: "1.0.0",
    hasPermision: 0,
    credit: "DANI",
    description: "random quran verse",
    usePrefix: true,
    commandCategory: "random-img",
    cooldowns: 0,
};
module.exports.run = async function({api, event, args, utils, Users, Threads}) {
  const axios = require("axios")
  const request = require("request")
  const fs = require("fs-extra")
  var link = ["https://i.imgur.com/bi3OG5E.jpeg" ,"https://i.imgur.com/U5JNgcs.jpeg" ,"https://i.imgur.com/g0MlFyZ.jpeg" ,"https://i.imgur.com/QpM4s4T.jpeg"
,"https://i.imgur.com/woxoR7X.jpg" 
,"https://i.imgur.com/pYfemVI.jpg"];
var alikoja = [`🥀Surat No 10 : سورة يونس - Ayat No 25

وَ اللّٰہُ یَدۡعُوۡۤا اِلٰی دَارِ السَّلٰمِ ؕ وَ یَہۡدِیۡ مَنۡ یَّشَآءُ  اِلٰی صِرَاطٍ مُّسۡتَقِیۡمٍ ﴿۲۵﴾

 اور اللہ تعالٰی سلامتی کے گھر کی طرف تم کو بلاتا ہے اور جس کو چاہتا ہے راہ راست پ\n\n ر چلنے کی توفیق دیتا ہے ۔ (𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`🥀Surat No 36 : سورة يس - Ayat No 50

فَلَا یَسۡتَطِیۡعُوۡنَ تَوۡصِیَۃً  وَّ لَاۤ  اِلٰۤی اَہۡلِہِمۡ   یَرۡجِعُوۡنَ ﴿۵۰﴾٪                   2

 اس وقت نہ تو یہ وصیت کر سکیں گے اور نہ اپنے اہل کی طرف لوٹ سکیں گے ۔  

\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)`,`🥀Surat No 17 : سورة بنی اسراءیل - Ayat No 52

یَوۡمَ  یَدۡعُوۡکُمۡ فَتَسۡتَجِیۡبُوۡنَ بِحَمۡدِہٖ وَ  تَظُنُّوۡنَ   اِنۡ   لَّبِثۡتُمۡ   اِلَّا   قَلِیۡلًا  ﴿۵۲﴾٪                 

 جس دن وہ تمہیں  بلائے گا تم اس کی تعریف کرتے ہوئے تعمیل ارشاد کرو گے اور گمان کرو گے کہ تمہارا رہنا بہت ہی تھوڑا ہے  ۔  

\n(𝘾𝙍𝙀𝘿𝙄𝙏 :-  𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`🥀Surat No 17 : سورة بنی اسراءیل - Ayat No 52

یَوۡمَ  یَدۡعُوۡکُمۡ فَتَسۡتَجِیۡبُوۡنَ بِحَمۡدِہٖ وَ  تَظُنُّوۡنَ   اِنۡ   لَّبِثۡتُمۡ   اِلَّا   قَلِیۡلًا  ﴿۵۲﴾٪                 

 جس دن وہ تمہیں  بلائے گا تم اس کی تعریف کرتے ہوئے تعمیل ارشاد کرو گے اور گمان کرو گے کہ تمہارا رہنا بہت ہی تھوڑا ہے  ۔  

\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`🥀Surat No 28 : سورة القصص - Ayat No 81

فَخَسَفۡنَا بِہٖ وَ بِدَارِہِ  الۡاَرۡضَ ۟ فَمَا  کَانَ لَہٗ  مِنۡ فِئَۃٍ  یَّنۡصُرُوۡنَہٗ  مِنۡ دُوۡنِ اللّٰہِ ٭ وَ مَا  کَانَ مِنَ الۡمُنۡتَصِرِیۡنَ ﴿۸۱﴾

  ۔   ( آخرکار )  ہم نے اسے  اس کے محل سمیت زمین میں دھنسا دیا  اور اللہ کے سوا کوئی جماعت اس کی مدد کے لئے تیار نہ ہوئی نہ وہ خود اپنے بچانے والوں میں سے ہو سکا ۔  

\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`🥀Surat No 23 : سورة المؤمنون - Ayat No 97 

وَ قُلۡ رَّبِّ اَعُوۡذُ بِکَ مِنۡ ہَمَزٰتِ الشَّیٰطِیۡنِ ﴿ۙ۹۷﴾

اور دعا کریں کہ اے میرے پروردگار! میں 
شیطانوں کے وسوسوں سے تیری پناہ چاہتا ہوں ۔

\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`🥀Surat No 55 : سورة الرحمن - Ayat No 23 

فَبِاَیِّ  اٰلَآءِ  رَبِّکُمَا تُکَذِّبٰنِ ﴿۲۳﴾
  
  پھر   تم اپنےرب کی کس کس  نعمت کو جھٹلاؤ گے ۔
  
  \n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)`,`🥀Surat No 47 : سورة محمد - Ayat No 1 

اَلَّذِیۡنَ  کَفَرُوۡا وَ صَدُّوۡا عَنۡ سَبِیۡلِ اللّٰہِ  اَضَلَّ  اَعۡمَالَہُمۡ ﴿۱﴾

 جن لوگوں نے کفر کیا اور اللہ کی راہ سے روکا  اللہ نے ان کے اعمال برباد کر دیئے ۔
 
 \n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`🥀Surat No 22 : سورة الحج - Ayat No 1 

یٰۤاَیُّہَا النَّاسُ اتَّقُوۡا رَبَّکُمۡ ۚ اِنَّ  زَلۡزَلَۃَ  السَّاعَۃِ  شَیۡءٌ  عَظِیۡمٌ ﴿۱﴾

 لوگو! اپنے پروردگار سے ڈرو! بلاشبہ قیامت کا زلزلہ بہت  ہی بڑی چیز ہے ۔
 
 \n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`🥀Surat No 9 : سورة التوبة - Ayat No 2 

فَسِیۡحُوۡا فِی الۡاَرۡضِ اَرۡبَعَۃَ  اَشۡہُرٍ وَّ اعۡلَمُوۡۤا  اَنَّکُمۡ غَیۡرُ مُعۡجِزِی اللّٰہِ ۙ وَ اَنَّ  اللّٰہَ  مُخۡزِی  الۡکٰفِرِیۡنَ ﴿۲﴾

 پس  ( اے مشرکو! )  تم ملک میں چار مہینے تک تو چل پھر لو   جان لو کہ تم اللہ کو عاجز کرنے والے نہیں ہو  اور یہ  ( بھی یاد رہے )  کہ اللہ کافروں کو رسوا کرنے والا ہے  ۔
 \n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`🥀Surat No 98 : سورة البينة - Ayat No 1 

لَمۡ  یَکُنِ الَّذِیۡنَ کَفَرُوۡا  مِنۡ  اَہۡلِ الۡکِتٰبِ وَ الۡمُشۡرِکِیۡنَ مُنۡفَکِّیۡنَ حَتّٰی تَاۡتِیَہُمُ  الۡبَیِّنَۃُ ۙ﴿۱﴾

 اہل کتاب کے کافر  اور مشرک لوگ جب تک کہ ان کے پاس ظاہر دلیل نہ آ جائے باز رہنے والے نہ تھے  ( وہ دلیل یہ )  تھی کہ   ۔
 
 \n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`🥀Surat No 59 : سورة الحشر - Ayat No 4 

ذٰلِکَ بِاَنَّہُمۡ  شَآقُّوا اللّٰہَ وَ رَسُوۡلَہٗ ۚ وَ مَنۡ یُّشَآقِّ  اللّٰہَ  فَاِنَّ اللّٰہَ شَدِیۡدُ الۡعِقَابِ ﴿۴﴾

 یہ اس لئے کہ انہوں نے اللہ تعالٰی کی اور اس کے رسول کی مخالفت کی اور جو بھی اللہ کی مخالفت کرے گا تو اللہ تعالٰی بھی سخت عذاب کرنے والا ہے ۔
 
 \n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`Surat No 62 : سورة الجمعة - Ayat No 2 

ہُوَ الَّذِیۡ  بَعَثَ فِی  الۡاُمِّیّٖنَ  رَسُوۡلًا مِّنۡہُمۡ  یَتۡلُوۡا عَلَیۡہِمۡ  اٰیٰتِہٖ  وَ  یُزَکِّیۡہِمۡ وَ  یُعَلِّمُہُمُ  الۡکِتٰبَ وَ  الۡحِکۡمَۃَ ٭ وَ  اِنۡ کَانُوۡا مِنۡ  قَبۡلُ  لَفِیۡ ضَلٰلٍ  مُّبِیۡنٍ ۙ﴿۲﴾

 وہی ہے جس نے ناخواندہ لوگوں  میں ان ہی میں سے ایک رسول بھیجا جو انہیں اس کی آیتیں پڑھ کر سناتا ہے اور ان کو پاک کرتا ہے اور انہیں کتاب و حکمت سکھاتا ہے ۔  یقیناً یہ اس سے پہلے کھلی گمراہی میں تھے ۔
 
 \n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`Surat No 47 : سورة محمد - Ayat No 2 

وَ الَّذِیۡنَ  اٰمَنُوۡا وَ عَمِلُوا الصّٰلِحٰتِ وَ اٰمَنُوۡا بِمَا نُزِّلَ عَلٰی مُحَمَّدٍ وَّ ہُوَ الۡحَقُّ مِنۡ  رَّبِّہِمۡ ۙ کَفَّرَ عَنۡہُمۡ سَیِّاٰتِہِمۡ  وَ اَصۡلَحَ بَالَہُمۡ ﴿۲﴾

 اور جو لوگ ایمان لائے اور اچھے کام کئے اور اس پر بھی ایمان لائے جو محمد  ( صلی اللہ علیہ وسلم )  پر اتاری گئی  ہے اور دراصل ان کے رب کی طرف سے سچا  ( دین )  بھی وہی ہے ،  اللہ نے ان کے گناہ دور کر دیئے  اور ان کے حال کی اصلاح کر دی ۔
 
 \n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`Surat No 62 : سورة الجمعة - Ayat No 1 

یُسَبِّحُ  لِلّٰہِ مَا فِی السَّمٰوٰتِ وَ مَا فِی الۡاَرۡضِ الۡمَلِکِ الۡقُدُّوۡسِ الۡعَزِیۡزِ الۡحَکِیۡمِ ﴿۱﴾

  ۔  ( ساری چیزیں )  جو آسمانوں اور زمین میں ہیں اللہ تعالٰی کی پاکی بیان کرتی ہیں  ( جو )  بادشاہ نہایت پاک  ( ہے )  غالب و با حکمت ہے ۔
  
  \n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)` ,`Surat No 3 : سورة آل عمران - Ayat No 4 

مِنۡ قَبۡلُ ہُدًی لِّلنَّاسِ وَ اَنۡزَلَ الۡفُرۡقَانَ  ۬ ؕ اِنَّ الَّذِیۡنَ کَفَرُوۡا بِاٰیٰتِ اللّٰہِ لَہُمۡ عَذَابٌ شَدِیۡدٌ ؕ وَ اللّٰہُ عَزِیۡزٌ ذُو انۡتِقَامٍ ﴿۴﴾

 اس سے پہلے لوگوں کو ہدایت کرنے والی بنا کر  اور قرآن بھی اسی نے اتارا  جو لوگ اللہ تعالٰی کی آیتوں سے کفر کرتے ہیں ان کے لئے سخت عذاب ہے اور اللہ تعالٰی غالب ہے ،  بدلہ لینے والا ۔

\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ꦿ⃟ۜ✯🌸)`];
  var juswa1 = alikoja[Math.floor(Math.random() * alikoja.length)];
  var callback = () => api.sendMessage({body:`${juswa1}`,attachment: fs.createReadStream(__dirname + "/cache/zac.jpg")}, event.threadID, () => fs.unlinkSync(__dirname + "/cache/zac.jpg")); 
      return request(encodeURI(link[Math.floor(Math.random() * link.length)])).pipe(fs.createWriteStream(__dirname+"/cache/zac.jpg")).on("close",() => callback());
   };