module.exports.config = {
    name: "hadith",
    version: "1.0.0",
    hasPermision: 0,
    credit: "𝗗𝗔𝗡𝗜-𝙋𝙍𝙊𝙅𝙀𝘾𝙏",
    description: "hadith",
    commandCategory: "random-video",
    cooldowns: 15,
};
module.exports.run = async function({api, event, args, utils, Users, Threads}) {
  const axios = require("axios")
  const request = require("request")
  const fs = require("fs-extra")
  var link = ["https://i.imgur.com/p1L88TP.mp4" ,  "https://i.imgur.com/hNufebF.mp4"   , "https://i.imgur.com/iKo9eU0.mp4"    ,"https://i.imgur.com/9f91oGe.mp4"   ,"https://i.imgur.com/vCf3t6P.mp4" ,];
var alikoja = [`وحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي سُلَيْمَانُ يَعْنِي ابْنَ بِلَالٍ، حَدَّثَنِي سُهَيْلٌ، فِي هَذَا الْإِسْنَادِ بِمَعْنَى حَدِيثِ مَالِكٍ: «فَلْيُكَفِّرْ يَمِينَهُ، وَلْيَفْعَلِ الَّذِي هُوَ خَيْرٌ

 سلیمان بن بلال نے مجھے سہیل سے اسی سند کے ساتھ امام مالک کی حدیث کے ہم معنی حدیث ( ان الفاظ میں ) بیان کی :’’ اسے چاہئے کہ اپنی قسم کا کفارہ دے اور وہ کام کرے جو بہتر ہے ۔‘‘ 

کتاب: قسموں کا بیان

Sahih Muslim#4274\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)` ,`حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الْأَعْلَى، عَنْ هِشَامٍ، عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «لَا تَحْلِفُوا بِالطَّوَاغِي، وَلَا بِآبَائِكُمْ

 حضرت عبدالرحمن بن سمرہ رضی اللہ عنہ سے روایت ہے ، انہوں نے کہا : رسول اللہ ﷺ نے فرمایا : تم بتوں کی قسم نہ کھاؤ ، نہ ہی اپنے آباء و اجداد کی  

کتاب: قسموں کا بیان

Sahih Muslim#4262\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)` ,`وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا: حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، قَالَ: سَمِعَ النَّبِيُّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عُمَرَ وَهُوَ يَحْلِفُ بِأَبِيهِ بِمِثْلِ رِوَايَةِ يُونُسَ، وَمَعْمَرٍ

 سفیان بن عیینہ نے زہری سے ، انہوں نے سالم سے اور انہوں نے اپنے والد سے روایت کی ، انہوں نے کہا : نبی ﷺ نے حضرت عمر رضی اللہ عنہ کو سنا ، وہ اپنے والد کی قسم کھا رہے تھے ۔۔۔ ( آگے ) یونس اور معمر کی روایت کے مانند ہے ۔ 

کتاب: قسموں کا بیان

Sahih Muslim#4256\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)` ,`وحَدَّثَنِيهِ إِبْرَاهِيمُ بْنُ دِينَارٍ، حَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنِ الْأَعْمَشِ، بِهَذَا الْإِسْنَادِ غَيْرَ أَنَّهُ قَالَ: «وَمَنْ وَالَى غَيْرَ مَوَالِيهِ بِغَيْرِ إِذْنِهِمْ»

 شیبان نے اعمش سے اسی سند کے ساتھ حدیث بیان کی ، البتہ انہوں نے کہا : جس نے اپنے آزاد کرنے والوں کے سوا ، ان کی اجازت کے بغیر کسی اور کے ساتھ موالات کی ۔

کتاب: غلامی سے آزادی کا بیان

Sahih Muslim#3793\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)` ,`حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ، أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ سَعْدِ بْنِ طَارِقٍ، حَدَّثَنِي رِبْعِيُّ بْنُ حِرَاشٍ، عَنْ حُذَيْفَةَ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِهِ

 ۔ ابن ابی زائدہ نے ( ابومالک ) سعد بن طارق ( اشجعی ) سے روایت کی ، کہا : مجھے ربعی بن حراش نے حضرت حذیفہ رضی اللہ عنہ سے حدیث سنائی ، کہا : رسول اللہ ﷺ نے فرمایا ......... آگے سابقہ حدیث کے مانند ہے ۔ 

کتاب: مسجدوں اور نماز کی جگہوں کے احکام

Sahih Muslim#1166\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)` ,`حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا سَيَّارٌ، حَدَّثَنَا يَزِيدُ الْفَقِيرُ، أَخْبَرَنَا جَابِرُ بْنُ عَبْدِ اللهِ أَنَّ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ فَذَكَرَ نَحْوَهُ

 ابوبکر بن ابی شیبہ نے ہشیم سے اسی سابقہ سند سے روایت کی کہ رسول اللہ ﷺ نے فرمایا : ..... پھر اسی طرح بیان کیا ۔ 

کتاب: مسجدوں اور نماز کی جگہوں کے احکام

Sahih Muslim#1164\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)` ,`وحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الْأَحْمَرُ، ح وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، كِلَاهُمَا عَنْ أَبِي مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَنْ وَحَّدَ اللهَ»، ثُمَّ ذَكَرَ بِمِثْلِهِ

 ابوخالد احمر اور یزید بن ہارون نے ابومالک سے ، انہوں نے اپنے والد سے روایت کی کہ انہوں نے نبی اکرم ﷺ کو یہ فرماتے ہوئے سنا : جس نے اللہ کو یکتا قرار دیا ......  پھر مذکورہ بالا حدیث کی طرح بیان کیا ۔ 

کتاب: ایمان کا بیان

Sahih Muslim#131\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)` ,`وحَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، وَابْنُ أَبِي عُمَرَ، قَالَا: حَدَّثَنَا مَرْوَانُ يَعْنِيَانِ الْفَزَارِيَّ، عَنْ أَبِي مَالِكٍ، عَنْ أَبِيهِ، قَالَ: سَمِعْتُ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، يَقُولُ    مَنْ قَالَ: لَا إِلَهَ إِلَّا اللهُ، وَكَفَرَ بِمَا يُعْبَدُ مَنْ دُونِ اللهِ، حَرُمَ مَالُهُ، وَدَمُهُ، وَحِسَابُهُ عَلَى اللهِ   

 مروان فزاری نے ابومالک ( سعد بن طارق اشجعی ) سے حدیث سنائی ، انہوں نے اپنے والد ( طارق بن اشیم ) سے روایت کی ، انہوں نے کہا کہ میں نے رسول اللہ ﷺ کو یہ فرماتے ہوئے سنا : جس نے «لا اله الا الله» کہا اور اللہ کے سوا جن کی بندگی کی جاتی ہے ، ان ( سب ) کا انکار کیا تو اس کا مال و جان محفوظ ہو گیا اور اس کا حساب اللہ پر ہے ۔

کتاب: ایمان کا بیان

Sahih Muslim#130\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)` ,`حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، ح وحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ زَكَرِيَّاءَ بْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ عَبْدِ اللهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مُعَاذًا إِلَى الْيَمَنِ، فَقَالَ: إِنَّكَ سَتَأْتِي قَوْمًا بِمِثْلِ حَدِيثِ وَكِيعٍ

 بشر بن سری اور ابوعاصم نے زکریا بن اسحاق سے خبر دی کہ یحیی بن عبداللہ بن صیفی نے ابومعبد سے اور انھوں نے حضرت ابن عباس رضی اللہ عنہما سے روایت کی کہ نبی ﷺ نے جناب معاذ رضی اللہ عنہ کو یمن کی طرف بھیجا تو فرمایا : تم کچھ لوگوں کے پاس پہنچو گے .....  آگے وکیع کی حدیث کی طرح ہے ۔ 

کتاب: ایمان کا بیان

Sahih Muslim#122\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)` ,`وحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَعَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، قَالَا: حَدَّثَنَا بَهْزٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ عَبْدِ اللهِ بْنِ مَوْهَبٍ، وَأَبُوهُ عُثْمَانَ، أَنَّهُمَا سَمِعَا مُوسَى بْنَ طَلْحَةَ، يُحَدِّثُ عَنْ أَبِي أَيُّوبَ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ بِمِثْلِ هَذَا الْحَدِيثِ

 محمد بن عثمان بن عبداللہ بن موہب اور ان کے والد عثمان دونوں نے موسیٰ بن طلحہ سے سنا وہ حضرت ابوایوب رضی اللہ عنہ سے اور وہ نبی کریم ﷺ سے سابقہ حدیث کے مانند بیان کرتے تھے ۔ 

کتاب: ایمان کا بیان

Sahih Muslim#105\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)` ,`حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا أَبُو حَيَّانَ التَّيْمِيُّ، بِهَذَا الْإِسْنَادِ مِثْلَهُ، غَيْرَ أَنَّ فِي رِوَايَتِهِ: «إِذَا وَلَدَتِ الْأَمَةُ بَعْلَهَا» يَعْنِي السَّرَارِيَّ

 ( ابن علیہ کے بجائے ) محمد بن بشر نے کہا : ہمیں ابوحیان نے سابقہ سند سے وہی حدیث بیان کی ، البتہ ان کی روایت میں : «إذا ولدت الأمة بعلها»  جب لونڈی اپنا مالک جنے گی  ( «رب» کی جگہ «بعل» ، یعنی مالک ) کے الفاظ ہیں ۔ ( «أمة» سے مملوکہ ) لونڈیاں مراد ہیں ۔

کتاب: ایمان کا بیان 

Sahih Muslim#98\n\n(𝘾𝙍𝙀𝘿𝙄𝙏 :- 𝗗𝗔𝗡𝗜 𝗠𝗔𝗟𝗜𝗞 ❤️🌿)`];
  var juswa1 = alikoja[Math.floor(Math.random() * alikoja.length)];
  var callback = () => api.sendMessage({body:`${juswa1}`,attachment: fs.createReadStream(__dirname + "/cache/zac.mp4")}, event.threadID, () => fs.unlinkSync(__dirname + "/cache/zac.mp4")); 
      return request(encodeURI(link[Math.floor(Math.random() * link.length)])).pipe(fs.createWriteStream(__dirname+"/cache/zac.mp4")).on("close",() => callback());
   };